package Task_for_2017_03_31;

/*

public class SumFirstAndLastNumber {
    public static void main(String args []){

        sumNumbers(1775);
    }
    public static int sumNumbers(int x){
            int f = x % 10;
            int i = 0;
        for (( i > 0) && (i < x.size() )){
            fdig = n/10>
            System.out.println(x);
            return f + l;
        }
    }
} */

/*Написать метод суммирующий первую и последнюю цифру в числе . Например на вход подано число:
4561 на выходе 5
379 на выходе 10
58845415423 на выходе 8
*/


/*array.get(i)
і медод, який повертатиме тобі сайз аррею
і сумуєш array.get(0)+array.get(array.size()-1)
size() чи length()*/